In [2]:
import pandas as pd

In [ ]:
#Save DataFrame to a CSV file
df.to_csv("people.csv", index=False)

In [ ]:
df.to_excel("people.xlsx", index=False)

In [ ]:
df.to_excel("people.xlsx", index=False, sheet_name="Sheet1")

In [ ]:
df.to_json("people.json", orient="records")
#Produces a list of row objects (each row becomes a JSON object).

In [ ]:
df.to_json("people.json", orient="records", indent=4)

# reading a csv file

In [4]:
s = pd.read_csv("D:\simple_data.csv")
s

   id name   age
0   1    A  25.0
1   2    B  25.0
2   3    C  28.0
3   4    D   NaN

In [3]:
s.values

array([['A', 25.0],
       ['B', 25.0],
       ['C', 28.0],
       ['D', nan]], dtype=object)

In [4]:
s.columns

Index(['name', 'age'], dtype='object')

In [5]:
s.index

RangeIndex(start=0, stop=4, step=1)

In [4]:
s['name']

0    A
1    B
2    C
3    D
Name: name, dtype: object

# parameters of .read_csv

In [ ]:
sep='\t',','
names=['c1','c2'] #Custom column names
index_col='c2' # which column you want to make index
header=1 # Row number used as header, or None header: 
#row number to use as the column headers (default is the first row);
use_cols=['c1','c2'] # colmn you want to include in your database 
nrows=100
na_values=(["NA", "Missing"])   #Additional strings to treat as NaN
skiprows              #Skip initial rows

In [ ]:
pd.read_excel("file.xlsx", sheet_name="Sheet1")

In [ ]:
pd.read_json("file.json")

#  from a web link (URL)

In [ ]:
df = pd.read_csv("https://example.com/data.csv")

In [ ]:
df = pd.read_csv("file.txt", sep="\t")

In [58]:
df=pd.read_csv("D:\samples_data.csv")
df

   id     name    age   gender     salary   join_date department  score
0   1    Alice   25.0        F    50000.0  2021-05-10      Sales   88.0
1   2      Bob   30.0        M    62000.0  2020/03/15         HR   92.0
2   3  Charlie    NaN        M    58000.0  15-07-2019         IT   79.0
3   4    david   45.0     male        NaN          IT        NaN    NaN
4   5      Eve   -3.0        F    72000.0  2022-13-01        NaN   65.0
5   5      Eve  200.0      NaN  1000000.0  2018-11-20    Finance  300.0
6   7    Frank   33.0        M    54000.0  wrong_date    finance   73.0
7   8      NaN   29.0   FEMALE    51000.0  2021-09-01      Sales   85.0
8   9   Grace     NaN        F    49000.0  2020/12/01      SALES   90.0
9  10    Henry   41.0  Unknown        NaN  2017-05-05         IT   82.0

In [6]:
pd.set_option("display.max_rows",300)
pd.set_option("display.max_columns",300)

In [4]:
import warnings
warnings.filterwarnings("ignore")

In [6]:
df.head(5)

   id     name   age gender   salary   join_date department  score
0   1    Alice  25.0      F  50000.0  2021-05-10      Sales   88.0
1   2      Bob  30.0      M  62000.0  2020/03/15         HR   92.0
2   3  Charlie   NaN      M  58000.0  15-07-2019         IT   79.0
3   4    david  45.0   male      NaN          IT        NaN    NaN
4   5      Eve  -3.0      F  72000.0  2022-13-01        NaN   65.0

In [7]:
df.columns

Index(['id', 'name', 'age', 'gender', 'salary', 'join_date', 'department',
       'score'],
      dtype='object')

In [8]:
df[['id', 'name', 'age', 'gender', 'salary', 'join_date', 'department',
       'score']]

   id     name    age   gender     salary   join_date department  score
0   1    Alice   25.0        F    50000.0  2021-05-10      Sales   88.0
1   2      Bob   30.0        M    62000.0  2020/03/15         HR   92.0
2   3  Charlie    NaN        M    58000.0  15-07-2019         IT   79.0
3   4    david   45.0     male        NaN          IT        NaN    NaN
4   5      Eve   -3.0        F    72000.0  2022-13-01        NaN   65.0
5   5      Eve  200.0      NaN  1000000.0  2018-11-20    Finance  300.0
6   7    Frank   33.0        M    54000.0  wrong_date    finance   73.0
7   8      NaN   29.0   FEMALE    51000.0  2021-09-01      Sales   85.0
8   9   Grace     NaN        F    49000.0  2020/12/01      SALES   90.0
9  10    Henry   41.0  Unknown        NaN  2017-05-05         IT   82.0

In [ ]:
#dataframe attribute and methods

In [9]:
df.shape

(10, 8)

In [21]:
df.dtypes

id              int64
name           object
age           float64
gender         object
salary        float64
join_date      object
department     object
score         float64
dtype: object

In [10]:
len(df.columns)

8

In [22]:
df.values

array([[1, 'Alice', 25.0, 'female', 50000.0, '2021-05-10', 'Sales', 88.0],
       [2, 'Bob', 30.0, 'male', 62000.0, '2020/03/15', 'HR', 92.0],
       [3, 'Charlie', nan, 'male', 58000.0, '15-07-2019', 'IT', 79.0],
       [4, 'david', 45.0, nan, nan, 'IT', nan, nan],
       [5, 'Eve', -3.0, 'female', 72000.0, '2022-13-01', nan, 65.0],
       [5, 'Eve', 200.0, nan, 1000000.0, '2018-11-20', 'Finance', 300.0],
       [7, 'Frank', 33.0, 'male', 54000.0, 'wrong_date', 'finance', 73.0],
       [8, nan, 29.0, 'female', 51000.0, '2021-09-01', 'Sales', 85.0],
       [9, ' Grace ', nan, 'female', 49000.0, '2020/12/01', 'SALES',
        90.0],
       [10, 'Henry', 41.0, nan, nan, '2017-05-05', 'IT', 82.0]],
      dtype=object)

In [8]:
df.tail(5)

   id      name    age   gender     salary   join_date department  score
5   5       Eve  200.0      NaN  1000000.0  2018-11-20    Finance  300.0
6   7     Frank   33.0        M    54000.0  wrong_date    finance   73.0
7   8       NaN   29.0   FEMALE    51000.0  2021-09-01      Sales   85.0
8   9    Grace     NaN        F    49000.0  2020/12/01      SALES   90.0
9  10     Henry   41.0  Unknown        NaN  2017-05-05         IT   82.0

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          10 non-null     int64
 1   name        9 non-null      object
 2   age         8 non-null      float64
 3   gender      9 non-null      object
 4   salary      8 non-null      float64
 5   join_date   9 non-null      object
 6   department  9 non-null      object
 7   score       9 non-null      float64
dtypes: float64(3), int64(1), object(4)
memory usage: 772.0+ bytes

In [ ]:
This function produces descriptive statistics for the DataFrame, that is, the central tendency (mean, median, min, max, etc.), dispersion, etc. It analyses the data and generates an output for both numeric and non-numeric data types accordingly.

In [10]:
df.describe()

              id         age          salary       score
count  10.000000    8.000000        8.000000    9.000000
mean    5.400000   50.000000   174500.000000  106.000000
std     3.025815   62.301112   333639.668762   73.252986
min     1.000000   -3.000000    49000.000000   65.000000
25%     3.250000   28.000000    50750.000000   79.000000
50%     5.000000   31.500000    56000.000000   85.000000
75%     7.750000   42.000000    64500.000000   90.000000
max    10.000000  200.000000  1000000.000000  300.000000

In [10]:
df.describe(percentiles=[0.1, 0.25, 0.5, 0.75, 0.9])

              id         age          salary       score
count  10.000000    8.000000        8.000000    9.000000
mean    5.400000   50.000000   174500.000000  106.000000
std     3.025815   62.301112   333639.668762   73.252986
min     1.000000   -3.000000    49000.000000   65.000000
10%     1.900000   16.600000    49700.000000   71.400000
25%     3.250000   28.000000    50750.000000   79.000000
50%     5.000000   31.500000    56000.000000   85.000000
75%     7.750000   42.000000    64500.000000   90.000000
90%     9.100000   91.500000   350400.000000  133.600000
max    10.000000  200.000000  1000000.000000  300.000000

In [ ]:
functions

In [ ]:
value_count()
sort_value(ascending=False)
sort_index
set_index
rename
reset_index
unique
nunique
isnull
not null
has nan
dropna
fillna
drop_duplicates
drop
apply
isin

In [15]:
df['gender'].value_counts()

gender
F          3
M          3
male       1
FEMALE     1
Unknown    1
Name: count, dtype: int64

In [16]:
df['department'].value_counts()

department
Sales      2
IT         2
HR         1
Finance    1
finance    1
SALES      1
Name: count, dtype: int64

In [17]:
df['gender'].unique()

array(['F', 'M', 'male', nan, 'FEMALE', 'Unknown'], dtype=object)

In [18]:
df['gender'].nunique()

5

In [19]:
df['gender']=df['gender'].map({'M':'male','F':'female','FEMALE':'female'})

In [20]:
df.set_index(['id'])

       name    age  gender     salary   join_date department  score
id
1     Alice   25.0  female    50000.0  2021-05-10      Sales   88.0
2       Bob   30.0    male    62000.0  2020/03/15         HR   92.0
3   Charlie    NaN    male    58000.0  15-07-2019         IT   79.0
4     david   45.0     NaN        NaN          IT        NaN    NaN
5       Eve   -3.0  female    72000.0  2022-13-01        NaN   65.0
5       Eve  200.0     NaN  1000000.0  2018-11-20    Finance  300.0
7     Frank   33.0    male    54000.0  wrong_date    finance   73.0
8       NaN   29.0  female    51000.0  2021-09-01      Sales   85.0
9    Grace     NaN  female    49000.0  2020/12/01      SALES   90.0
10    Henry   41.0     NaN        NaN  2017-05-05         IT   82.0

In [25]:
df.sort_values('score',ascending=False)

   id     name    age  gender     salary   join_date department  score
5   5      Eve  200.0     NaN  1000000.0  2018-11-20    Finance  300.0
1   2      Bob   30.0    male    62000.0  2020/03/15         HR   92.0
8   9   Grace     NaN  female    49000.0  2020/12/01      SALES   90.0
0   1    Alice   25.0  female    50000.0  2021-05-10      Sales   88.0
7   8      NaN   29.0  female    51000.0  2021-09-01      Sales   85.0
9  10    Henry   41.0     NaN        NaN  2017-05-05         IT   82.0
2   3  Charlie    NaN    male    58000.0  15-07-2019         IT   79.0
6   7    Frank   33.0    male    54000.0  wrong_date    finance   73.0
4   5      Eve   -3.0  female    72000.0  2022-13-01        NaN   65.0
3   4    david   45.0     NaN        NaN          IT        NaN    NaN

In [26]:
df.sort_values('score',ascending=False,na_position='first')

   id     name    age  gender     salary   join_date department  score
3   4    david   45.0     NaN        NaN          IT        NaN    NaN
5   5      Eve  200.0     NaN  1000000.0  2018-11-20    Finance  300.0
1   2      Bob   30.0    male    62000.0  2020/03/15         HR   92.0
8   9   Grace     NaN  female    49000.0  2020/12/01      SALES   90.0
0   1    Alice   25.0  female    50000.0  2021-05-10      Sales   88.0
7   8      NaN   29.0  female    51000.0  2021-09-01      Sales   85.0
9  10    Henry   41.0     NaN        NaN  2017-05-05         IT   82.0
2   3  Charlie    NaN    male    58000.0  15-07-2019         IT   79.0
6   7    Frank   33.0    male    54000.0  wrong_date    finance   73.0
4   5      Eve   -3.0  female    72000.0  2022-13-01        NaN   65.0

In [27]:
df.sort_values(['salary','score'],ascending=[True,False])

   id     name    age  gender     salary   join_date department  score
8   9   Grace     NaN  female    49000.0  2020/12/01      SALES   90.0
0   1    Alice   25.0  female    50000.0  2021-05-10      Sales   88.0
7   8      NaN   29.0  female    51000.0  2021-09-01      Sales   85.0
6   7    Frank   33.0    male    54000.0  wrong_date    finance   73.0
2   3  Charlie    NaN    male    58000.0  15-07-2019         IT   79.0
1   2      Bob   30.0    male    62000.0  2020/03/15         HR   92.0
4   5      Eve   -3.0  female    72000.0  2022-13-01        NaN   65.0
5   5      Eve  200.0     NaN  1000000.0  2018-11-20    Finance  300.0
9  10    Henry   41.0     NaN        NaN  2017-05-05         IT   82.0
3   4    david   45.0     NaN        NaN          IT        NaN    NaN

In [32]:
#This sorts the rows in ascending order of the index.
df.sort_index()

   id     name    age  gender     salary   join_date department  score
0   1    Alice   25.0  female    50000.0  2021-05-10      Sales   88.0
1   2      Bob   30.0    male    62000.0  2020/03/15         HR   92.0
2   3  Charlie    NaN    male    58000.0  15-07-2019         IT   79.0
3   4    david   45.0     NaN        NaN          IT        NaN    NaN
4   5      Eve   -3.0  female    72000.0  2022-13-01        NaN   65.0
5   5      Eve  200.0     NaN  1000000.0  2018-11-20    Finance  300.0
6   7    Frank   33.0    male    54000.0  wrong_date    finance   73.0
7   8      NaN   29.0  female    51000.0  2021-09-01      Sales   85.0
8   9   Grace     NaN  female    49000.0  2020/12/01      SALES   90.0
9  10    Henry   41.0     NaN        NaN  2017-05-05         IT   82.0

In [33]:
df.sort_index(ascending=False)

   id     name    age  gender     salary   join_date department  score
9  10    Henry   41.0     NaN        NaN  2017-05-05         IT   82.0
8   9   Grace     NaN  female    49000.0  2020/12/01      SALES   90.0
7   8      NaN   29.0  female    51000.0  2021-09-01      Sales   85.0
6   7    Frank   33.0    male    54000.0  wrong_date    finance   73.0
5   5      Eve  200.0     NaN  1000000.0  2018-11-20    Finance  300.0
4   5      Eve   -3.0  female    72000.0  2022-13-01        NaN   65.0
3   4    david   45.0     NaN        NaN          IT        NaN    NaN
2   3  Charlie    NaN    male    58000.0  15-07-2019         IT   79.0
1   2      Bob   30.0    male    62000.0  2020/03/15         HR   92.0
0   1    Alice   25.0  female    50000.0  2021-05-10      Sales   88.0

In [34]:
df.sort_index(axis=1) # sort by column name

     age department  gender  id   join_date     name     salary  score
0   25.0      Sales  female   1  2021-05-10    Alice    50000.0   88.0
1   30.0         HR    male   2  2020/03/15      Bob    62000.0   92.0
2    NaN         IT    male   3  15-07-2019  Charlie    58000.0   79.0
3   45.0        NaN     NaN   4          IT    david        NaN    NaN
4   -3.0        NaN  female   5  2022-13-01      Eve    72000.0   65.0
5  200.0    Finance     NaN   5  2018-11-20      Eve  1000000.0  300.0
6   33.0    finance    male   7  wrong_date    Frank    54000.0   73.0
7   29.0      Sales  female   8  2021-09-01      NaN    51000.0   85.0
8    NaN      SALES  female   9  2020/12/01   Grace     49000.0   90.0
9   41.0         IT     NaN  10  2017-05-05    Henry        NaN   82.0

In [35]:
#Rename a single column
#df.rename(columns={"old_name": "new_name"}, inplace=True)
df.rename(columns={"name": "ename", "salary": "esalary"}, inplace=True)

In [36]:
df

   id    ename    age  gender    esalary   join_date department  score
0   1    Alice   25.0  female    50000.0  2021-05-10      Sales   88.0
1   2      Bob   30.0    male    62000.0  2020/03/15         HR   92.0
2   3  Charlie    NaN    male    58000.0  15-07-2019         IT   79.0
3   4    david   45.0     NaN        NaN          IT        NaN    NaN
4   5      Eve   -3.0  female    72000.0  2022-13-01        NaN   65.0
5   5      Eve  200.0     NaN  1000000.0  2018-11-20    Finance  300.0
6   7    Frank   33.0    male    54000.0  wrong_date    finance   73.0
7   8      NaN   29.0  female    51000.0  2021-09-01      Sales   85.0
8   9   Grace     NaN  female    49000.0  2020/12/01      SALES   90.0
9  10    Henry   41.0     NaN        NaN  2017-05-05         IT   82.0

In [37]:
df.isnull() # df.isna() same

      id  ename    age  gender  esalary  join_date  department  score
0  False  False  False   False    False      False       False  False
1  False  False  False   False    False      False       False  False
2  False  False   True   False    False      False       False  False
3  False  False  False    True     True      False        True   True
4  False  False  False   False    False      False        True  False
5  False  False  False    True    False      False       False  False
6  False  False  False   False    False      False       False  False
7  False   True  False   False    False      False       False  False
8  False  False   True   False    False      False       False  False
9  False  False  False    True     True      False       False  False

In [41]:
df.isna()

      id  ename    age  gender  esalary  join_date  department  score
0  False  False  False   False    False      False       False  False
1  False  False  False   False    False      False       False  False
2  False  False   True   False    False      False       False  False
3  False  False  False    True     True      False        True   True
4  False  False  False   False    False      False        True  False
5  False  False  False    True    False      False       False  False
6  False  False  False   False    False      False       False  False
7  False   True  False   False    False      False       False  False
8  False  False   True   False    False      False       False  False
9  False  False  False    True     True      False       False  False

# drop nulls

In [ ]:
	axis = 0 (by default) Drops rows
axis = 1 Drops columns

inplace = True    Modifies the original DataFrame
inplace = False (default)          Creates a new DataFrame

In [ ]:
df

In [42]:
df.dropna()  # delete all row having single null value

   id  ename   age  gender  esalary   join_date department  score
0   1  Alice  25.0  female  50000.0  2021-05-10      Sales   88.0
1   2    Bob  30.0    male  62000.0  2020/03/15         HR   92.0
6   7  Frank  33.0    male  54000.0  wrong_date    finance   73.0

In [44]:
df.dropna(how="all") #Drop rows only if ALL values are null

   id    ename    age  gender    esalary   join_date department  score
0   1    Alice   25.0  female    50000.0  2021-05-10      Sales   88.0
1   2      Bob   30.0    male    62000.0  2020/03/15         HR   92.0
2   3  Charlie    NaN    male    58000.0  15-07-2019         IT   79.0
3   4    david   45.0     NaN        NaN          IT        NaN    NaN
4   5      Eve   -3.0  female    72000.0  2022-13-01        NaN   65.0
5   5      Eve  200.0     NaN  1000000.0  2018-11-20    Finance  300.0
6   7    Frank   33.0    male    54000.0  wrong_date    finance   73.0
7   8      NaN   29.0  female    51000.0  2021-09-01      Sales   85.0
8   9   Grace     NaN  female    49000.0  2020/12/01      SALES   90.0
9  10    Henry   41.0     NaN        NaN  2017-05-05         IT   82.0

In [50]:
df.dropna(subset=["age", "esalary"],ignore_index=True)#Drop rows with nulls in specific columns

   id  ename   age  gender  esalary   join_date department  score
0   1  Alice  25.0  female  50000.0  2021-05-10      Sales   88.0
1   2    Bob  30.0    male  62000.0  2020/03/15         HR   92.0
2   7  Frank  33.0    male  54000.0  wrong_date    finance   73.0

In [ ]:
# Drop rows or columns using a threshold

In [47]:
#Drop rows that have fewer than thresh non-null values

# drop row
df.dropna(axis=0, thresh=int(0.8*len(df)))    #inplace=True
#Keeps only row that have at least 80% non-null values

In [ ]:
df

df.dropna(axis=1, thresh=int(0.7*len(df))) #inplace=True
#Keeps only column that have at least 70% non-null values

In [49]:
 df.drop('age', axis=1)

   id  ename  gender  esalary   join_date department  score
0   1  Alice  female  50000.0  2021-05-10      Sales   88.0
1   2    Bob    male  62000.0  2020/03/15         HR   92.0
6   7  Frank    male  54000.0  wrong_date    finance   73.0

In [ ]:
#df = df.drop(['col1', 'col2'], axis=1)

In [ ]:
del df['column_name']

In [ ]:
df.pop('column_name')

# fillna

In [ ]:
df.fillna("not_defined") # replace all null with "not defined"

In [ ]:
df["age"].fillna(0)     # replace age null with 0

In [ ]:
df["age"] = df["age"].fillna(df["age"].mean())

In [ ]:
df["salary"] = df["salary"].fillna(df["salary"].median())

In [ ]:
df["gender"] = df["gender"].fillna(df["gender"].mode()[0]) # return series 
#mode() calculates the most frequent value in the column

# drop duplicates

# Detect Duplicates

In [51]:
#Check which rows are duplicates
df.duplicated()
#Returns a Boolean Series (True if the row is a duplicate, False otherwise).

0    False
1    False
6    False
dtype: bool

In [52]:
#Check duplicates in a specific column
df.duplicated(subset=["id"])

0    False
1    False
6    False
dtype: bool

In [ ]:
# drop duplicates

In [53]:
#Drop duplicate rows based on all columns
df.drop_duplicates(inplace=True)

In [54]:
df

   id  ename   age  gender  esalary   join_date department  score
0   1  Alice  25.0  female  50000.0  2021-05-10      Sales   88.0
1   2    Bob  30.0    male  62000.0  2020/03/15         HR   92.0
6   7  Frank  33.0    male  54000.0  wrong_date    finance   73.0

In [ ]:
#Drop duplicates row  based on specific columns
df.drop_duplicates(subset=["id"], inplace=True)
#Keeps the first occurrence by default.

In [ ]:
#Keep last occurrence instead of first
df.drop_duplicates(subset=["id"], keep="last", inplace=True)

In [ ]:
#Drop all duplicates (keep none)
df.drop_duplicates(subset=["id"], keep=False, inplace=True)
#Removes all rows that have duplicates in the subset.

In [55]:
# Count duplicates

df.duplicated().sum()          # Count duplicates in all columns

np.int64(0)

# rename column

In [ ]:
#Rename a single column
df.rename(columns={"old_name": "new_name"}, inplace=True)
df.rename(columns={"age": "Age", "salary": "Salary_USD"}, inplace=True)

In [ ]:
#Rename all columns at once
df.columns = ["ID", "Name", "Age", "Gender", "Salary", "JoinDate", "Department", "Score"]

# Drop Columns

In [ ]:
#Drop a  unnecessary single column
df.drop("column_name", axis=1, inplace=True)

In [ ]:
#Drop multiple columns
df.drop(["score", "join_date"], axis=1, inplace=True)

In [ ]:
df.groupby('department')['salary'].mean()

# filter the data based on condition


df["department"].isin(["Sales", "IT"])

df[df["department"].isin(["Sales", "IT"])]

df["salary"].isna()

#Find rows with missing values using isna()
df[df["salary"].isna()]

#Find all rows where department is Sales (case-insensitive)
df["department"].str.lower().isin(["sales"])

df[df["department"].str.lower().isin(["sales"])]

# acess the row

In [12]:
df

   id      name    age   gender     salary   join_date department  score
0   1     Alice   25.0        F    50000.0  2021-05-10      Sales   88.0
1   2       Bob   30.0        M    62000.0  2020/03/15         HR   92.0
2   3   Charlie    NaN        M    58000.0  15-07-2019         IT   79.0
3   4     david   45.0     male        NaN         NaN         IT    NaN
4   5       Eve   -3.0        F    72000.0  2022-13-01        NaN   65.0
5   5       Eve  200.0      NaN  1000000.0  2018-11-20    Finance  300.0
6   7     Frank   33.0        M    54000.0  wrong_date    finance   73.0
7   8       NaN   29.0   FEMALE    51000.0  2021-09-01      Sales   85.0
8   9    Grace     NaN        F    49000.0  2020/12/01      SALES   90.0
9  10     Henry   41.0  Unknown        NaN  2017-05-05         IT   82.0

In [ ]:
df['id']

In [ ]:
df[['id']]

In [15]:
df[['id','name','age']]

   id      name    age
0   1     Alice   25.0
1   2       Bob   30.0
2   3   Charlie    NaN
3   4     david   45.0
4   5       Eve   -3.0
5   5       Eve  200.0
6   7     Frank   33.0
7   8       NaN   29.0
8   9    Grace     NaN
9  10     Henry   41.0

In [59]:
df.loc[1:4]

   id     name   age gender   salary   join_date department  score
1   2      Bob  30.0      M  62000.0  2020/03/15         HR   92.0
2   3  Charlie   NaN      M  58000.0  15-07-2019         IT   79.0
3   4    david  45.0   male      NaN          IT        NaN    NaN
4   5      Eve  -3.0      F  72000.0  2022-13-01        NaN   65.0

In [60]:
df.loc[[1,2,3,4]]

   id     name   age gender   salary   join_date department  score
1   2      Bob  30.0      M  62000.0  2020/03/15         HR   92.0
2   3  Charlie   NaN      M  58000.0  15-07-2019         IT   79.0
3   4    david  45.0   male      NaN          IT        NaN    NaN
4   5      Eve  -3.0      F  72000.0  2022-13-01        NaN   65.0

In [61]:
df.loc[1:5:2]

   id   name    age gender     salary   join_date department  score
1   2    Bob   30.0      M    62000.0  2020/03/15         HR   92.0
3   4  david   45.0   male        NaN          IT        NaN    NaN
5   5    Eve  200.0    NaN  1000000.0  2018-11-20    Finance  300.0

In [62]:
# fetch row +some columns
df.loc[1:5,['id','name']] # all include

   id     name
1   2      Bob
2   3  Charlie
3   4    david
4   5      Eve
5   5      Eve

In [18]:
df.loc[[1,3,5,6],['id','name']]

   id   name
1   2    Bob
3   4  david
5   5    Eve
6   7  Frank

In [19]:
df.iloc[0:4,0:2]  # exclude

   id     name
0   1    Alice
1   2      Bob
2   3  Charlie
3   4    david

In [20]:
df.iloc[:-1, :] #all rows except the last one

   id      name    age  gender     salary   join_date department  score
0   1     Alice   25.0       F    50000.0  2021-05-10      Sales   88.0
1   2       Bob   30.0       M    62000.0  2020/03/15         HR   92.0
2   3   Charlie    NaN       M    58000.0  15-07-2019         IT   79.0
3   4     david   45.0    male        NaN         NaN         IT    NaN
4   5       Eve   -3.0       F    72000.0  2022-13-01        NaN   65.0
5   5       Eve  200.0     NaN  1000000.0  2018-11-20    Finance  300.0
6   7     Frank   33.0       M    54000.0  wrong_date    finance   73.0
7   8       NaN   29.0  FEMALE    51000.0  2021-09-01      Sales   85.0
8   9    Grace     NaN       F    49000.0  2020/12/01      SALES   90.0

In [22]:
df.iloc[:1, :]

   id   name   age gender   salary   join_date department  score
0   1  Alice  25.0      F  50000.0  2021-05-10      Sales   88.0

In [21]:
df.iloc[1:, :]

   id      name    age   gender     salary   join_date department  score
1   2       Bob   30.0        M    62000.0  2020/03/15         HR   92.0
2   3   Charlie    NaN        M    58000.0  15-07-2019         IT   79.0
3   4     david   45.0     male        NaN         NaN         IT    NaN
4   5       Eve   -3.0        F    72000.0  2022-13-01        NaN   65.0
5   5       Eve  200.0      NaN  1000000.0  2018-11-20    Finance  300.0
6   7     Frank   33.0        M    54000.0  wrong_date    finance   73.0
7   8       NaN   29.0   FEMALE    51000.0  2021-09-01      Sales   85.0
8   9    Grace     NaN        F    49000.0  2020/12/01      SALES   90.0
9  10     Henry   41.0  Unknown        NaN  2017-05-05         IT   82.0

# Fixing data types

In [10]:
#Check current data types
df.dtypes

id              int64
name           object
age           float64
gender         object
salary        float64
join_date      object
department     object
score         float64
dtype: object

In [11]:
df

   id      name    age   gender     salary   join_date department  score
0   1     Alice   25.0        F    50000.0  2021-05-10      Sales   88.0
1   2       Bob   30.0        M    62000.0  2020/03/15         HR   92.0
2   3   Charlie    NaN        M    58000.0  15-07-2019         IT   79.0
3   4     david   45.0     male        NaN        None         IT    NaN
4   5       Eve   -3.0        F    72000.0  2022-13-01       None   65.0
5   5       Eve  200.0     None  1000000.0  2018-11-20    Finance  300.0
6   7     Frank   33.0        M    54000.0  wrong_date    finance   73.0
7   8      None   29.0   FEMALE    51000.0  2021-09-01      Sales   85.0
8   9    Grace     NaN        F    49000.0  2020/12/01      SALES   90.0
9  10     Henry   41.0  Unknown        NaN  2017-05-05         IT   82.0

In [ ]:
#join_date is object (string), but it should be datetime.
#age, salary, score may be float even though they could be int.

In [ ]:
age -> float ->Int64 (why not int64 because of nan )
salary ->float64->to_numeric

In [ ]:
Normal NumPy integer dtypes (int64, int32, etc.) cannot store NaN, because NaN is a float-only concept.
So if your column has any missing values, pandas will force it to become float64:
[10, 20, NaN]  dtype becomes float64

In [67]:
#Convert columns to numeric types
#Convert column to integer, handling NaNs:
df["age"] = df["age"].astype("Int64")  # Pandas nullable integer
df["score"] = df["score"].astype("Int64")

In [ ]:
int64 not handle none 
Int64 can handle none and convert into NAN
object can be convert into string (none converted into <na>)

In [68]:
df

   id     name   age   gender     salary   join_date department  score
0   1    Alice    25        F    50000.0  2021-05-10      Sales     88
1   2      Bob    30        M    62000.0  2020/03/15         HR     92
2   3  Charlie  <NA>        M    58000.0  15-07-2019         IT     79
3   4    david    45     male        NaN          IT        NaN   <NA>
4   5      Eve    -3        F    72000.0  2022-13-01        NaN     65
5   5      Eve   200      NaN  1000000.0  2018-11-20    Finance    300
6   7    Frank    33        M    54000.0  wrong_date    finance     73
7   8      NaN    29   FEMALE    51000.0  2021-09-01      Sales     85
8   9   Grace   <NA>        F    49000.0  2020/12/01      SALES     90
9  10    Henry    41  Unknown        NaN  2017-05-05         IT     82

In [69]:
df.dtypes

id              int64
name           object
age             Int64
gender         object
salary        float64
join_date      object
department     object
score           Int64
dtype: object

In [ ]:
The column contains integers + maybe some NaNs use  Int64
#when  you need to convert a messy column into numbers. use to_numeric with error='coerce'

In [ ]:
#Convert text columns to categorical
#For columns with limited categories like gender or department:

df["gender"] = df["gender"].astype("category")
df["department"] = df["department"].astype("category")

#Benefits:
Reduces memory usage
Faster groupby / filtering

# Convert date columns

In [ ]:
default MM-DD-YYYY.
Pandas will interpret dates in DD-MM-YYYY when use dayfirst=True

In [ ]:
df["join_date"] = pd.to_datetime(df["join_date"], errors="coerce", dayfirst=True)

#errors="coerce"  invalid dates become NaT (null datetime)
#dayfirst=True  interprets 15-07-2019 as 15th July

# ADVANCED PANDAS

In [ ]:
df.groupby('department')['salary'].mean()

# filter the data based on condition


df["department"].isin(["Sales", "IT"])

df[df["department"].isin(["Sales", "IT"])]

df["salary"].isna()

#Find rows with missing values using isna()
df[df["salary"].isna()]

#Find all rows where department is Sales (case-insensitive)
df["department"].str.lower().isin(["sales"])

df[df["department"].str.lower().isin(["sales"])]

# selecting and filtering

# Select columns by data type

In [ ]:
df.select_dtypes(include="number")     # All numeric columns
df.select_dtypes(include="object")     # All object (string) columns
df.select_dtypes(include="category")   # All categorical columns

In [19]:
numeric_cols = df.select_dtypes(include="number").columns
df[numeric_cols] # boolean masking
#include="number" means all numeric columns: int64, float64, Int64, etc.

   id   age     salary  score
0   1    25    50000.0     88
1   2    30    62000.0     92
2   3  <NA>    58000.0     79
3   4    45        NaN   <NA>
4   5    -3    72000.0     65
5   5   200  1000000.0    300
6   7    33    54000.0     73
7   8    29    51000.0     85
8   9  <NA>    49000.0     90
9  10    41        NaN     82

In [ ]:
Merging and Concatenating DataFrames

In [ ]:
left: This will select the entries only in the first DataFrame.
right: This will consider the entries only in the second DataFrame.
outer: This considers the union of all the entries in the DataFrames.
inner: This will result in the intersection of the keys from both DataFrames.

In [ ]:
dataframe_1.merge(dataframe_2, on = ['column_1', 'column_2'], how = 'merge_type')

In [ ]:
Concatenating DataFrames: Add columns or rows from one DataFrame to another

In [ ]:
pd.concat([dataframe_1, dataframe_2], axis = _)
#axis = 0 to append rows
#axis = 1 to append columns

In [ ]:
/marks_1.csv', header = None, sep = '|'